leeehui/stm32f4-eth-template-without-os/Apps/freertos_cli/Sample-CLI-commands.c
/* Structure that defines the "echo_3_parameters" command line command.  This
takes exactly three parameters that the command simply echos back one at a
time. */
static const CLI_Command_Definition_t xThreeParameterEcho =
{
	"echo-3-parameters",
	"\r\necho-3-parameters <param1> <param2> <param3>:\r\n Expects three parameters, echos each in turn\r\n",
	prvThreeParameterEchoCommand, /* The function to run. */
	3 /* Three parameters are expected, which can take any value. */
};

/* Structure that defines the "echo_parameters" command line command.  This
takes a variable number of parameters that the command simply echos back one at
a time. */
static const CLI_Command_Definition_t xParameterEcho =
{
	"echo-parameters",
	"\r\necho-parameters <...>:\r\n Take variable number of parameters, echos each in turn\r\n",
	prvParameterEchoCommand, /* The function to run. */
	-1 /* The user can enter any number of commands. */
};

/* Structure that defines the "led" command line command.  This
takes a variable number of parameters that the command simply echos back one at
a time. */
static const CLI_Command_Definition_t xLed =
{
	"led",
	"\r\nled [start | stop]:\r\n Starts or stops LED\r\n",
	prvLedCommand, /* The function to run. */
	1 /* The user can enter any number of commands. */
};


#if( configGENERATE_RUN_TIME_STATS == 1 )
	/* Structure that defines the "run-time-stats" command line command.   This
	generates a table that shows how much run time each task has */
	static const CLI_Command_Definition_t xRunTimeStats =
	{
		"run-time-stats", /* The command string to type. */
		"\r\nrun-time-stats:\r\n Displays a table showing how much processing time each FreeRTOS task has used\r\n",
		prvRunTimeStatsCommand, /* The function to run. */
		0 /* No parameters are expected. */
	};
#endif /* configGENERATE_RUN_TIME_STATS */

#if( configINCLUDE_QUERY_HEAP_COMMAND == 1 )
	/* Structure that defines the "query_heap" command line command. */
	static const CLI_Command_Definition_t xQueryHeap =
	{
		"query-heap",
		"\r\nquery-heap:\r\n Displays the free heap space, and minimum ever free heap space.\r\n",
		prvQueryHeapCommand, /* The function to run. */
		0 /* The user can enter any number of commands. */
	};
#endif /* configQUERY_HEAP_COMMAND */

#if configINCLUDE_TRACE_RELATED_CLI_COMMANDS == 1
	/* Structure that defines the "trace" command line command.  This takes a single
	parameter, which can be either "start" or "stop". */
	static const CLI_Command_Definition_t xStartStopTrace =
	{
		"trace",
		"\r\ntrace [start | stop]:\r\n Starts or stops a trace recording for viewing in FreeRTOS+Trace\r\n",
		prvStartStopTraceCommand, /* The function to run. */
		1 /* One parameter is expected.  Valid values are "start" and "stop". */
	};
#endif /* configINCLUDE_TRACE_RELATED_CLI_COMMANDS */

    
static BaseType_t prvConfigIPCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString );
static const CLI_Command_Definition_t xConfigIP =
{
    "config-ip",
    "\r\nconfig-ip <ip1> <ip2> <ip3> <ip4> <port>:\r\n config ip address and port.\r\n",
    prvConfigIPCommand, /* The function to run. */
    5 /* The user can enter any number of commands. */
};
 
#define ConfigIPParamMaxLen 10
static BaseType_t prvConfigIPCommand( char *pcWriteBuffer, size_t xWriteBufferLen, const char *pcCommandString )
{
const char *pcParameter;
BaseType_t xParameterStringLength, xReturn;
static UBaseType_t uxParameterNumber = 0;
uint8_t tempBuffer[ConfigIPParamMaxLen];
uint8_t numBuffer[ConfigIPParamMaxLen];
static uint32_t ip[4];
static uint32_t port;
	/* Remove compile time warnings about unused parameters, and check the
	write buffer is not NULL.  NOTE - for simplicity, this example assumes the
	write buffer length is adequate, so does not check for buffer overflows. */
	( void ) pcCommandString;
	( void ) xWriteBufferLen;
	//configASSERT( pcWriteBuffer );

	if( uxParameterNumber == 0 )
	{
		/* The first time the function is called after the command has been
		entered just a header string is returned. */
		//sprintf( pcWriteBuffer, "The three parameters were:\r\n" );
        debug(info, "The 5 parameters were:" );

		/* Next time the function is called the first parameter will be echoed
		back. */
		uxParameterNumber = 1U;

		/* There is more data to be returned as no parameters have been echoed
		back yet. */
		xReturn = pdPASS;
	}
	else
	{
		/* Obtain the parameter string. */
		pcParameter = FreeRTOS_CLIGetParameter
						(
							pcCommandString,		/* The command string itself. */
							uxParameterNumber,		/* Return the next parameter. */
							&xParameterStringLength	/* Store the parameter string length. */
						);

		/* Sanity check something was returned. */
		//configASSERT( pcParameter );
        
		/* Return the parameter string. */
		//memset( pcWriteBuffer, 0x00, xWriteBufferLen );
		sprintf( tempBuffer, "%d: ", ( int ) uxParameterNumber );
        if(xParameterStringLength > ConfigIPParamMaxLen)
        {
            xParameterStringLength = ConfigIPParamMaxLen;
        }
		strncat( tempBuffer, pcParameter, ( size_t ) xParameterStringLength );
		//strncat( pcWriteBuffer, "\r\n", strlen( "\r\n" ) );
        debug(info, "%s.", tempBuffer);
        
        sprintf( numBuffer, "%s", ( int ) pcParameter);
        
        //debug(info, "%d", atoi(numBuffer));   
        if(uxParameterNumber < 5)
        {
            ip[uxParameterNumber-1] = atoi(numBuffer);
            debug(info, "%d",ip[uxParameterNumber-1]);
        }
        else if(uxParameterNumber == 5)
        {
            port = atoi(numBuffer);
            debug(info, "%d",port);
        }
        memset(tempBuffer, 0, ConfigIPParamMaxLen);

		/* If this is the last of the three parameters then there are no more
		strings to return after this one. */
		if( uxParameterNumber == 5U )
		{
            ip4_addr_t ipaddr;
            IP4_ADDR(&ipaddr, ip[0], ip[1], ip[2], ip[3]);
            set_ip(ipaddr, port);
			/* If this is the last of the three parameters then there are no more
			strings to return after this one. */
			xReturn = pdFALSE;
			uxParameterNumber = 0;
		}
		else
		{
			/* There are more parameters to return after this one. */
			xReturn = pdTRUE;
			uxParameterNumber++;
		}
	}

	return xReturn;
}

   
/*-----------------------------------------------------------*/

void vRegisterSampleCLICommands( void )
{
	/* Register all the command line commands defined immediately above. */
#if 0
	FreeRTOS_CLIRegisterCommand( &xTaskStats );	
	FreeRTOS_CLIRegisterCommand( &xThreeParameterEcho );
	FreeRTOS_CLIRegisterCommand( &xParameterEcho );
	FreeRTOS_CLIRegisterCommand( &xLed );
	#if( configGENERATE_RUN_TIME_STATS == 1 )
	{
		FreeRTOS_CLIRegisterCommand( &xRunTimeStats );
	}
	#endif
	
